import 'package:flutter/material.dart';

import 'PAGE THREE.dart';

class sec extends StatefulWidget {
  List cat_list;
  int index;

  sec(this.cat_list, this.index);

  State<sec> createState() => _secState();
}

class _secState extends State<sec> {
  List<String> gazal = [
    "तारों के बाग़ में, प्यार की खुशबू बिखरी,चाँदनी रातों में, दिल की बातें हो जाती हैं सारी।",
    "दिल की धड़कनें रात के कमरों में गूँथी हैं,प्यार की सुरीली सरगम, दिल को बेहलाती है बरसात में।",
    "तेरे आगे, मेरी दिल की भीड़ में शांति है,तेरे आगे, मेरे दिल को सुकून का मकान मिलता है।",
    "तेरे जाने के बाद, मेरा दिल एक वीराना बन गया,तेरे प्यार की प्यास, एक आबूदान में खो गई है।",
    "दो आत्माएँ प्यार के अनंत सुर में नृत्य करती हैं,वही चाँद के नीचे, हमारा एक समान रूप दिखाती हैं।",
    "रात की कैनवास पर, सितारे धीरे-धीरे रोते हैं,तेरी यादें, एक लोरी की तरह, मेरे सपनों में बितती हैं।",
    "तेरी हँसी, एक बगीचा है जहां सपने उड़ते हैं,तेरे आगे, हर पल बिल्कुल सही लगता है।",
    "प्यार की मधुर सुरीली मेलोदी, एक गीत जो कभी नहीं समाप्त होता,तेरे दिल की मेल, मेरी आत्मा को उंचा उड़ाता है।",
    "तेरी गायबी में, मेरा दिल एक विशाल मरुस्थल है,तेरे प्यार की प्यास, ऐसे ही अर्द्धरूप में खो गई है।",
    "ददो दिल, जैसे शायरी, हमेशा मिले हुए होते हैं,प्यार के बगीचे में, हमारी आत्मा एक होती है।"
  ];
  List<String> nazam = [
    "हर सुबह उठकर आँखों में नयी ख्वाहिश जगी,मोहब्बत की राह में दिल धड़का बेइंतहा।",
    "रात की चुप्पी में खो जाती है सबकी बातें,दर्द की राहों में ढूँढता हूँ मैं अपनी आवाज़।",
    "धूप की किरणों में बिखरती है जिंदगी की खुशियाँ,अपनी धुंध में खोजता हूँ मैं अपना रास्ता।",
    "मंजिलों की खोज में खो गया हूँ खुद को,अपनी राह में खो गया हूँ खुद को।",
    "ज़िन्दगी की राहों में भटकते भटकते,खुद की तलाश में भटकते भटकते।",
    "आँखों में सपनों की उम्मीदें जगी,मन में बसे अभिलाषाओं की बारिश है।",
    "जीवन की लम्बी राहों में,हर बार खुद से ही मुकाबला है।",
    "चलते चलते ज़िन्दगी की राहों में,हर कदम पे खुद को समझना है।",
    "जीवन की राहों में खो गया हूँ खुद को,अपनी मंजिल में पहुँचना है मुझे।",
    "ख्वाबों की दुनिया में खोया हूँ मैं,अपनी हकीकत में पहचाना है मुझे।"
  ];
  List<String> Rubaiyat = [
    "ज़िंदगी के सफर में हर मोड़ पे,दोस्त मिले यार और राहें हो सुहानी।",
    "चाँदनी रातों में जब याद तुम्हारी आती है,दिल को छू जाती है वो मीठी सी बातें तुम्हारी।",
    "ख्वाबों की दुनिया में खो जाते हैं हम,हकीकत में खो जाती है वो मीठी सी मुलाकातें।",
    "दर्द भरी रातें भी गुज़र जाती हैं,खुशियों से भरी बातें याद रह जाती हैं।",
    "दिल की धड़कनों में बसती हैं तेरी यादें,खुशबू की तरह फैलती हैं तेरी बातें।",
    "मोहब्बत की राह में चलते चलते,दिल की धड़कनें तेज हो जाती हैं।",
    "दर्द की राहों में खो गया हूँ मैं,मोहब्बत की बातें याद रह जाती हैं।",
    "खुदा की राह में चलते चलते,दिल में भरी आशा हो जाती है।",
    "रात की चुप्पी में याद तेरी आती है,दिल की हर धड़कन में तेरी ही बातें होती हैं।",
    "ज़िन्दगी की राहों में खो जाते हैं हम,खुशियों से भरी बातें याद रह जाती हैं।"
  ];

  List<String> Marsiya = [
    "करबला की रात में लगती है जलती हुई चिता,हुसैन की याद में जलती हैं आँखें रोती हुई माता।",
    "लुट गई थी ज़िन्दगी करबला के मैदान में,आँखों में आंसू, दिल में दर्द, गुनगुनाती हैं माता।",
    "बेटे की शहादत पर माँ की आह कैसे भरी,करबला की रात में जलती हैं माता की चिता।",
    "शहीदों की याद में रोती हैं हर माँ,करबला की रात में उमड़ती हैं आंसू की धारा।",
    "करबला की धूप में छाया था दर्द और अफ़सोस,माता की आंखों में समा गई थी बेटे की याद की बारिश।",
    "लब पे आती हैं हर वक्त वो शहीदों की बातें,करबला की रात में जलती हैं माता की चिता।",
    'करबला की रात में भटकती हैं बच्चों की माँ,याद आते हैं वो दर्दभरे पल करबला के मैदान।',
    "जान दे दी थी माँ ने करबला की रात में,दिल में छाई है अब तक वो बेटे की याद की बारिश।",
    "रोती हैं माँ करबला की रात में,याद आते हैं बेटे के आखिरी लम्हे वो क़ुर्बानी की बारिश।",
    "आँखों में आंसू, दिल में दर्द, यादें करबला की रात की,माता की आह कैसे भरी, बेटे की याद में जलती हैं चिता।"
  ];
  List<String> Hasya = [
    "जब से वो फेसबुक पर आई है,उसके बिना व्यक्ति की फ्रेंड लिस्ट अधूरी है।",
    "वक़्त आने पर बीवी बन जाती है सास,सास बनती है दुल्हन, सब कुछ बिना जवाब के कहती है बेटा तुम्हारे पास।",
    "पढ़ाई करो, ताक़त बनो, सफलता पाओ,और फिर बच्चों के बिना खुशियाँ कैसे पाओ?",
    "जब आप किसी के साथ होते हो,वो बिना कुछ कहे ही समझ जाते हैं कि आप क्या सोच रहे हो।",
    "प्यार में होने वाला दर्द अच्छा होता है,क्योंकि उसके बाद आप जवाबों के बिना चुटकुले बना सकते हो!",
    "बच्चे तो बच्चों के काम होते हैं,लेकिन बड़ों की छुट्टी तो वो ही बर्बाद करते हैं।",
    "जब बच्चा रोता है, तो माँ-बाप कहते हैं,बिल्कुल मेरा है, तू बिलकुल मेरा है!",
    "पढ़ाई के दिन याद करके हँसते हैं हम,वक़्त बीतने के बाद पढ़ाई का क्या करेंगे हम?",
    "आजकल के बच्चे भी कुछ अलग ही हैं,अब वो स्मार्टफोन के साथ ही दुश्मन बना लेते हैं!",
    "विद्या का सफर बड़ा खुशियों भरा,परीक्षा के दिन छात्र थे बिल्कुल हैरान!",
    " जब से ट्विटर पर आए हैं, बच्चों की बातें अलग हो गई हैं,माँ, आज मेरे फॉलोअर्स ने मुझे चुप कर दिया",
    "दोस्ती करो तो बिना शराब के,और फिर दोस्त बनो, और शराब के साथ हंसो!"
  ];

  List<String> Sad = [
    "कभी खुशी की राहों में भटकते हैं हम,कभी दर्द की राहों में भटकते हैं हम।",
    "दिल की धड़कनें बस तेरे नाम से हैं,क्या करूँ, तेरी यादों से दर्द कम नहीं है।",
    "बेवफ़ाई का दर्द तो सबको मालूम है,पर क्या करें, इश्क़ में आदमी अजीब होता है।",
    "तेरी यादों की बरसात में भीगता हूँ,क्या करूँ, दर्द में भी तेरी यादें ही सहारा है।",
    "ख्वाबों की दुनिया में खो गया हूँ मैं,दर्द की राहों में भटकते भटकते हूँ मैं।",
    "वक़्त के साथ सबकुछ बदल जाता है,पहले वो था मेरा सब कुछ, अब सब कुछ वक़्त का हुआ।",
    "दर्द भरी रातें भी गुज़र जाती हैं,खुशियों से भरी बातें याद रह जाती हैं।",
    "ख्वाबों की दुनिया में जीने की आदत हो गई,ज़िन्दगी की हकीकत से मुलाकात हो गई।",
    "जीने की आदत से मुकर गई हैं हम,जिस दिन तुम्हारी यादों से दिल भर गया।",
    "ज़िन्दगी की राहों में खो गया हूँ मैं,खुद से मिलने की आशा में खो गया हू"
  ];
  List<String> Romantic = [
    "तेरी आँखों में खो जाऊँ मैं,तेरी बाहों में बिखर जाऊँ मैं।",
    " तेरी सांसों की महक से भर जाए जहां,तेरी बाहों में मिल जाए मेरी ज़िंदगी का आस्मान।",
    " तेरी यादों में खोया हूँ मैं,तेरी बातों में जी रहा हूँ मैं।",
    " तेरी खुशबू सा आये मेरे तन में,तेरी यादों का सहारा बन जाए मेरे मन में।",
    " तेरे प्यार की राहों में चलते चलते,दिल की धड़कनें तेरे नाम से भर जाती हैं।",
    " तेरी बाहों में जगह बनाई है मैंने,तेरी आँखों में खो जाऊँ मैं।",
    " तेरी मोहब्बत का जादू चाया है मेरे दिल पर,तेरी हर मुस्कान में छुपा है मेरा खुदा।",
    " तेरी यादों में रहते रहते,तेरे ख्वाबों में खो जाता हूँ मैं।",
    " तेरी बातों में उलझा हूँ मैं,तेरी यादों में बिखर जाता हूँ मैं।",
    " तेरे प्यार की बौछार में भिगोते हैं हम,तेरी बाहों में जगा है प्यार का जहां।"
  ];

  List blanklist = [];

  @override
  void initState() {
    super.initState();

    if (widget.index == 0) {
      blanklist = gazal;
    } else if (widget.index == 1) {
      blanklist = nazam;
    } else if (widget.index == 2) {
      blanklist = Rubaiyat;
    } else if (widget.index == 3) {
      blanklist = Marsiya;
    } else if (widget.index == 4) {
      blanklist = Hasya;
    } else if (widget.index == 5) {
      blanklist = Sad;
    } else if (widget.index == 6) {
      blanklist = Romantic;
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Colors.black,
        title: Text("${widget.cat_list[widget.index]}"),
      ),
      body: ListView.builder(
        itemCount: blanklist.length,
        itemBuilder: (context, index) {
          return Padding(
            padding: const EdgeInsets.all(5),
            child: ListTile(
              onTap: () {
                Navigator.push(context, MaterialPageRoute(
                  builder: (context) {
                    return tp(blanklist, index);
                  },
                ));
              },
              shape: BeveledRectangleBorder(
                  side: BorderSide(color: Colors.white24, width: 1)),
              tileColor: Colors.black,
              title: Text("${blanklist[index]}",
                  maxLines: 1,
                  style: TextStyle(color: Colors.white, fontSize: 20)),

              trailing: Icon(
                Icons.arrow_forward_ios_sharp,
                color: Colors.white30,
              ),
              leading: CircleAvatar(
                  radius: 30,
                  backgroundImage: AssetImage(
                    "Imagesss/ग़ज़ल8.jpg",
                  )),
              // leading: Container(
              //   height: 50,
              //   width: 50,
              //   decoration: BoxDecoration(
              //       shape: BoxShape.circle,
              //       image: DecorationImage(image: AssetImage("Imagesss/img1.jpeg"))),
              //   // child: Image.asset("Imagesss/img1.jpeg"),
              // ),
            ),
          );
        },
      ),
    );
  }
}
